TexasInstruments/f29h85x-sdk/source/driverlib/inc/hw_sent.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the BC_MTP_CMP3 register
//
//*************************************************************************************************
#define SENT_BC_MTP_CMP3_TOGGLETIME_S   0U
#define SENT_BC_MTP_CMP3_TOGGLETIME_M   0x7FFU        //
#define SENT_BC_MTP_CMP3_RSVD_S         11U
#define SENT_BC_MTP_CMP3_RSVD_M         0xFFFFF800U   //

//*************************************************************************************************
//
// The following are defines for the bit fields in the BC_MTP_CMP4 register
//
//*************************************************************************************************
#define SENT_BC_MTP_CMP4_TOGGLETIME_S   0U
#define SENT_BC_MTP_CMP4_TOGGLETIME_M   0x7FFU        //
#define SENT_BC_MTP_CMP4_RSVD_S         11U
#define SENT_BC_MTP_CMP4_RSVD_M         0xFFFFF800U   //

//*************************************************************************************************
//
// The following are defines for the bit fields in the BC_MTP_CMP5 register
//
//*************************************************************************************************
#define SENT_BC_MTP_CMP5_TOGGLETIME_S   0U
#define SENT_BC_MTP_CMP5_TOGGLETIME_M   0x7FFU        //
#define SENT_BC_MTP_CMP5_RSVD_S         11U
#define SENT_BC_MTP_CMP5_RSVD_M         0xFFFFF800U   //

//*************************************************************************************************
//
// The following are defines for the bit fields in the BC_MTP_CMP6 register
//
//*************************************************************************************************
#define SENT_BC_MTP_CMP6_TOGGLETIME_S   0U
#define SENT_BC_MTP_CMP6_TOGGLETIME_M   0x7FFU        //
#define SENT_BC_MTP_CMP6_RSVD_S         11U
#define SENT_BC_MTP_CMP6_RSVD_M         0xFFFFF800U   //

//*************************************************************************************************
//
// The following are defines for the bit fields in the BC_MTP_CMP7 register
//
//*************************************************************************************************
#define SENT_BC_MTP_CMP7_TOGGLETIME_S   0U
#define SENT_BC_MTP_CMP7_TOGGLETIME_M   0x7FFU        //
#define SENT_BC_MTP_CMP7_RSVD_S         11U
#define SENT_BC_MTP_CMP7_RSVD_M         0xFFFFF800U   //

//*************************************************************************************************
//
// The following are defines for the bit fields in the BC_MTP_CMP8 register
//
//*************************************************************************************************
#define SENT_BC_MTP_CMP8_TOGGLETIME_S   0U
#define SENT_BC_MTP_CMP8_TOGGLETIME_M   0x7FFU        //
#define SENT_BC_MTP_CMP8_RSVD_S         11U
#define SENT_BC_MTP_CMP8_RSVD_M         0xFFFFF800U   //

//*************************************************************************************************
//
// The following are defines for the bit fields in the BC_MTP_CMP9 register
//
//*************************************************************************************************
#define SENT_BC_MTP_CMP9_TOGGLETIME_S   0U
#define SENT_BC_MTP_CMP9_TOGGLETIME_M   0x7FFU        //
#define SENT_BC_MTP_CMP9_RSVD_S         11U
#define SENT_BC_MTP_CMP9_RSVD_M         0xFFFFF800U   //

//*************************************************************************************************
//
// The following are defines for the bit fields in the BC_MTP_PERIOD register
//
//*************************************************************************************************
#define SENT_BC_MTP_PERIOD_PERIOD_S   0U
#define SENT_BC_MTP_PERIOD_PERIOD_M   0x7FFU        //
#define SENT_BC_MTP_PERIOD_RSVD_S     11U
#define SENT_BC_MTP_PERIOD_RSVD_M     0xFFFFF800U   //

//*************************************************************************************************
//
// The following are defines for the bit fields in the BC_TRIGSEL register
//
//*************************************************************************************************
#define SENT_BC_TRIGSEL_TRIGSEL_S   0U
#define SENT_BC_TRIGSEL_TRIGSEL_M   0x7FU         //
#define SENT_BC_TRIGSEL_RSVD_S      7U
#define SENT_BC_TRIGSEL_RSVD_M      0xFFFFFF80U   //

//*************************************************************************************************
//
// The following are defines for the bit fields in the BC_MTP_SWTR register
//
//*************************************************************************************************
#define SENT_BC_MTP_SWTR_SWTR     0x1U          //
#define SENT_BC_MTP_SWTR_RSVD_S   1U
#define SENT_BC_MTP_SWTR_RSVD_M   0xFFFFFFFEU   //

//*************************************************************************************************
//
// The following are defines for the bit fields in the S1_MTP_EN register
//
//*************************************************************************************************
#define SENT_S1_MTP_EN_MTP_EN   0x1U          //
#define SENT_S1_MTP_EN_RSVD_S   1U
#define SENT_S1_MTP_EN_RSVD_M   0xFFFFFFFEU   //

//*************************************************************************************************
//
// The following are defines for the bit fields in the S1_MTP_CMP1 register
//
//*************************************************************************************************
#define SENT_S1_MTP_CMP1_TOGGLETIME_S   0U
#define SENT_S1_MTP_CMP1_TOGGLETIME_M   0x7FFU        //
#define SENT_S1_MTP_CMP1_RSVD_S         11U
#define SENT_S1_MTP_CMP1_RSVD_M         0xFFFFF800U   //

//*************************************************************************************************
//
// The following are defines for the bit fields in the S1_MTP_CMP2 register
//
//*************************************************************************************************
#define SENT_S1_MTP_CMP2_TOGGLETIME_S   0U
#define SENT_S1_MTP_CMP2_TOGGLETIME_M   0x7FFU        //
#define SENT_S1_MTP_CMP2_RSVD_S         11U
#define SENT_S1_MTP_CMP2_RSVD_M         0xFFFFF800U   //

//*************************************************************************************************
//
// The following are defines for the bit fields in the S1_MTP_CMP3 register
//
//*************************************************************************************************
#define SENT_S1_MTP_CMP3_TOGGLETIME_S   0U
#define SENT_S1_MTP_CMP3_TOGGLETIME_M   0x7FFU        //
#define SENT_S1_MTP_CMP3_RSVD_S         11U
#define SENT_S1_MTP_CMP3_RSVD_M         0xFFFFF800U   //

//*************************************************************************************************
//
// The following are defines for the bit fields in the S1_MTP_CMP4 register
//
//*************************************************************************************************
#define SENT_S1_MTP_CMP4_TOGGLETIME_S   0U
#define SENT_S1_MTP_CMP4_TOGGLETIME_M   0x7FFU        //
#define SENT_S1_MTP_CMP4_RSVD_S         11U
#define SENT_S1_MTP_CMP4_RSVD_M         0xFFFFF800U   //

//*************************************************************************************************
//
// The following are defines for the bit fields in the S1_MTP_CMP5 register
//
//*************************************************************************************************
#define SENT_S1_MTP_CMP5_TOGGLETIME_S   0U
#define SENT_S1_MTP_CMP5_TOGGLETIME_M   0x7FFU        //
#define SENT_S1_MTP_CMP5_RSVD_S         11U
#define SENT_S1_MTP_CMP5_RSVD_M         0xFFFFF800U   //

//*************************************************************************************************
//
// The following are defines for the bit fields in the S1_MTP_CMP6 register
//
//*************************************************************************************************
#define SENT_S1_MTP_CMP6_TOGGLETIME_S   0U
#define SENT_S1_MTP_CMP6_TOGGLETIME_M   0x7FFU        //
#define SENT_S1_MTP_CMP6_RSVD_S         11U
#define SENT_S1_MTP_CMP6_RSVD_M         0xFFFFF800U   //

//*************************************************************************************************
//
// The following are defines for the bit fields in the S1_MTP_CMP7 register
//
//*************************************************************************************************
#define SENT_S1_MTP_CMP7_TOGGLETIME_S   0U
#define SENT_S1_MTP_CMP7_TOGGLETIME_M   0x7FFU        //
#define SENT_S1_MTP_CMP7_RSVD_S         11U
#define SENT_S1_MTP_CMP7_RSVD_M         0xFFFFF800U   //

//*************************************************************************************************
//
// The following are defines for the bit fields in the S1_MTP_CMP8 register
//
//*************************************************************************************************
#define SENT_S1_MTP_CMP8_TOGGLETIME_S   0U
#define SENT_S1_MTP_CMP8_TOGGLETIME_M   0x7FFU        //
#define SENT_S1_MTP_CMP8_RSVD_S         11U
#define SENT_S1_MTP_CMP8_RSVD_M         0xFFFFF800U   //

//*************************************************************************************************
//
// The following are defines for the bit fields in the S1_MTP_CMP9 register
//
//*************************************************************************************************
#define SENT_S1_MTP_CMP9_TOGGLETIME_S   0U
#define SENT_S1_MTP_CMP9_TOGGLETIME_M   0x7FFU        //
#define SENT_S1_MTP_CMP9_RSVD_S         11U
#define SENT_S1_MTP_CMP9_RSVD_M         0xFFFFF800U   //

//*************************************************************************************************
//
// The following are defines for the bit fields in the S1_MTP_CMP10RE register
//
//*************************************************************************************************
#define SENT_S1_MTP_CMP10RE_TOGGLETIME_S   0U
#define SENT_S1_MTP_CMP10RE_TOGGLETIME_M   0x7FFU        //
#define SENT_S1_MTP_CMP10RE_RSVD_S         11U
#define SENT_S1_MTP_CMP10RE_RSVD_M         0xFFFFF800U   //

//*************************************************************************************************
//
// The following are defines for the bit fields in the S1_MTP_PERIOD register
//
//*************************************************************************************************
#define SENT_S1_MTP_PERIOD_PERIOD_S   0U
#define SENT_S1_MTP_PERIOD_PERIOD_M   0x7FFU        //
#define SENT_S1_MTP_PERIOD_RSVD_S     11U
#define SENT_S1_MTP_PERIOD_RSVD_M     0xFFFFF800U   //

//*************************************************************************************************
//
// The following are defines for the bit fields in the S1_TRIGSEL register
//
//*************************************************************************************************
#define SENT_S1_TRIGSEL_TRIGSEL_S   0U
#define SENT_S1_TRIGSEL_TRIGSEL_M   0x7FU         //
#define SENT_S1_TRIGSEL_RSVD_S      7U
#define SENT_S1_TRIGSEL_RSVD_M      0xFFFFFF80U   //

//*************************************************************************************************
//
// The following are defines for the bit fields in the S1_MTP_SWTR register
//
//*************************************************************************************************
#define SENT_S1_MTP_SWTR_SWTR     0x1U          //
#define SENT_S1_MTP_SWTR_RSVD_S   1U
#define SENT_S1_MTP_SWTR_RSVD_M   0xFFFFFFFEU   //

//*************************************************************************************************
//
// The following are defines for the bit fields in the S2_MTP_EN register
//
//*************************************************************************************************
#define SENT_S2_MTP_EN_MTP_EN   0x1U          //
#define SENT_S2_MTP_EN_RSVD_S   1U
#define SENT_S2_MTP_EN_RSVD_M   0xFFFFFFFEU   //

//*************************************************************************************************
//
// The following are defines for the bit fields in the S2_MTP_CMP1 register
//
//*************************************************************************************************
#define SENT_S2_MTP_CMP1_TOGGLETIME_S   0U
#define SENT_S2_MTP_CMP1_TOGGLETIME_M   0x7FFU        //
#define SENT_S2_MTP_CMP1_RSVD_S         11U
#define SENT_S2_MTP_CMP1_RSVD_M         0xFFFFF800U   //

//*************************************************************************************************
//
// The following are defines for the bit fields in the S2_MTP_CMP2 register
//
//*************************************************************************************************
#define SENT_S2_MTP_CMP2_TOGGLETIME_S   0U
#define SENT_S2_MTP_CMP2_TOGGLETIME_M   0x7FFU        //
#define SENT_S2_MTP_CMP2_RSVD_S         11U
#define SENT_S2_MTP_CMP2_RSVD_M         0xFFFFF800U   //

//*************************************************************************************************
//
// The following are defines for the bit fields in the S2_MTP_CMP3 register
//
//*************************************************************************************************
#define SENT_S2_MTP_CMP3_TOGGLETIME_S   0U
#define SENT_S2_MTP_CMP3_TOGGLETIME_M   0x7FFU        //
#define SENT_S2_MTP_CMP3_RSVD_S         11U
#define SENT_S2_MTP_CMP3_RSVD_M         0xFFFFF800U   //

//*************************************************************************************************
//
// The following are defines for the bit fields in the S2_MTP_CMP4 register
//
//*************************************************************************************************
#define SENT_S2_MTP_CMP4_TOGGLETIME_S   0U
#define SENT_S2_MTP_CMP4_TOGGLETIME_M   0x7FFU        //
#define SENT_S2_MTP_CMP4_RSVD_S         11U
#define SENT_S2_MTP_CMP4_RSVD_M         0xFFFFF800U   //

//*************************************************************************************************
//
// The following are defines for the bit fields in the S2_MTP_CMP5 register
//
//*************************************************************************************************
#define SENT_S2_MTP_CMP5_TOGGLETIME_S   0U
#define SENT_S2_MTP_CMP5_TOGGLETIME_M   0x7FFU        //
#define SENT_S2_MTP_CMP5_RSVD_S         11U
#define SENT_S2_MTP_CMP5_RSVD_M         0xFFFFF800U   //

//*************************************************************************************************
//
// The following are defines for the bit fields in the S2_MTP_CMP6 register
//
//*************************************************************************************************
#define SENT_S2_MTP_CMP6_TOGGLETIME_S   0U
#define SENT_S2_MTP_CMP6_TOGGLETIME_M   0x7FFU        //
#define SENT_S2_MTP_CMP6_RSVD_S         11U
#define SENT_S2_MTP_CMP6_RSVD_M         0xFFFFF800U   //

//*************************************************************************************************
//
// The following are defines for the bit fields in the S2_MTP_CMP7 register
//
//*************************************************************************************************
#define SENT_S2_MTP_CMP7_TOGGLETIME_S   0U
#define SENT_S2_MTP_CMP7_TOGGLETIME_M   0x7FFU        //
#define SENT_S2_MTP_CMP7_RSVD_S         11U
#define SENT_S2_MTP_CMP7_RSVD_M         0xFFFFF800U   //

//*************************************************************************************************
//
// The following are defines for the bit fields in the S2_MTP_CMP8 register
//
//*************************************************************************************************
#define SENT_S2_MTP_CMP8_TOGGLETIME_S   0U
#define SENT_S2_MTP_CMP8_TOGGLETIME_M   0x7FFU        //
#define SENT_S2_MTP_CMP8_RSVD_S         11U
#define SENT_S2_MTP_CMP8_RSVD_M         0xFFFFF800U   //

//*************************************************************************************************
//
// The following are defines for the bit fields in the S2_MTP_CMP9 register
//
//*************************************************************************************************
#define SENT_S2_MTP_CMP9_TOGGLETIME_S   0U
#define SENT_S2_MTP_CMP9_TOGGLETIME_M   0x7FFU        //
#define SENT_S2_MTP_CMP9_RSVD_S         11U
#define SENT_S2_MTP_CMP9_RSVD_M         0xFFFFF800U   //

//*************************************************************************************************
//
// The following are defines for the bit fields in the S2_MTP_CMP10RE register
//
//*************************************************************************************************
#define SENT_S2_MTP_CMP10RE_TOGGLETIME_S   0U
#define SENT_S2_MTP_CMP10RE_TOGGLETIME_M   0x7FFU        //
#define SENT_S2_MTP_CMP10RE_RSVD_S         11U
#define SENT_S2_MTP_CMP10RE_RSVD_M         0xFFFFF800U   //

//*************************************************************************************************
//
// The following are defines for the bit fields in the S2_MTP_PERIOD register
//
//*************************************************************************************************
#define SENT_S2_MTP_PERIOD_PERIOD_S   0U
#define SENT_S2_MTP_PERIOD_PERIOD_M   0x7FFU        //
#define SENT_S2_MTP_PERIOD_RSVD_S     11U
#define SENT_S2_MTP_PERIOD_RSVD_M     0xFFFFF800U   //

//*************************************************************************************************
//
// The following are defines for the bit fields in the S2_TRIGSEL register
//
//*************************************************************************************************
#define SENT_S2_TRIGSEL_TRIGSEL_S   0U
#define SENT_S2_TRIGSEL_TRIGSEL_M   0x7FU         //
#define SENT_S2_TRIGSEL_RSVD_S      7U
#define SENT_S2_TRIGSEL_RSVD_M      0xFFFFFF80U   //

//*************************************************************************************************
//
// The following are defines for the bit fields in the S2_MTP_SWTR register
//
//*************************************************************************************************
#define SENT_S2_MTP_SWTR_SWTR     0x1U          //
#define SENT_S2_MTP_SWTR_RSVD_S   1U
#define SENT_S2_MTP_SWTR_RSVD_M   0xFFFFFFFEU   //

//*************************************************************************************************
//
// The following are defines for the bit fields in the S3_MTP_EN register
//
//*************************************************************************************************
#define SENT_S3_MTP_EN_MTP_EN   0x1U          //
#define SENT_S3_MTP_EN_RSVD_S   1U
#define SENT_S3_MTP_EN_RSVD_M   0xFFFFFFFEU   //

//*************************************************************************************************
//
// The following are defines for the bit fields in the S3_MTP_CMP1 register
//
//*************************************************************************************************
#define SENT_S3_MTP_CMP1_TOGGLETIME_S   0U
#define SENT_S3_MTP_CMP1_TOGGLETIME_M   0x7FFU        //
#define SENT_S3_MTP_CMP1_RSVD_S         11U
#define SENT_S3_MTP_CMP1_RSVD_M         0xFFFFF800U   //

//*************************************************************************************************
//
// The following are defines for the bit fields in the S3_MTP_CMP2 register
//
//*************************************************************************************************
#define SENT_S3_MTP_CMP2_TOGGLETIME_S   0U
#define SENT_S3_MTP_CMP2_TOGGLETIME_M   0x7FFU        //
#define SENT_S3_MTP_CMP2_RSVD_S         11U
#define SENT_S3_MTP_CMP2_RSVD_M         0xFFFFF800U   //

//*************************************************************************************************
//
// The following are defines for the bit fields in the S3_MTP_CMP3 register
//
//*************************************************************************************************
#define SENT_S3_MTP_CMP3_TOGGLETIME_S   0U
#define SENT_S3_MTP_CMP3_TOGGLETIME_M   0x7FFU        //
#define SENT_S3_MTP_CMP3_RSVD_S         11U
#define SENT_S3_MTP_CMP3_RSVD_M         0xFFFFF800U   //

//*************************************************************************************************
//
// The following are defines for the bit fields in the S3_MTP_CMP4 register
//
//*************************************************************************************************
#define SENT_S3_MTP_CMP4_TOGGLETIME_S   0U
#define SENT_S3_MTP_CMP4_TOGGLETIME_M   0x7FFU        //
#define SENT_S3_MTP_CMP4_RSVD_S         11U
#define SENT_S3_MTP_CMP4_RSVD_M         0xFFFFF800U   //

//*************************************************************************************************
//
// The following are defines for the bit fields in the S3_MTP_CMP5 register
//
//*************************************************************************************************
#define SENT_S3_MTP_CMP5_TOGGLETIME_S   0U
#define SENT_S3_MTP_CMP5_TOGGLETIME_M   0x7FFU        //
#define SENT_S3_MTP_CMP5_RSVD_S         11U
#define SENT_S3_MTP_CMP5_RSVD_M         0xFFFFF800U   //

//*************************************************************************************************
//
// The following are defines for the bit fields in the S3_MTP_CMP6 register
//
//*************************************************************************************************
#define SENT_S3_MTP_CMP6_TOGGLETIME_S   0U
#define SENT_S3_MTP_CMP6_TOGGLETIME_M   0x7FFU        //
#define SENT_S3_MTP_CMP6_RSVD_S         11U
#define SENT_S3_MTP_CMP6_RSVD_M         0xFFFFF800U   //

//*************************************************************************************************
//
// The following are defines for the bit fields in the S3_MTP_CMP7 register
//
//*************************************************************************************************
#define SENT_S3_MTP_CMP7_TOGGLETIME_S   0U
#define SENT_S3_MTP_CMP7_TOGGLETIME_M   0x7FFU        //
#define SENT_S3_MTP_CMP7_RSVD_S         11U
#define SENT_S3_MTP_CMP7_RSVD_M         0xFFFFF800U   //

//*************************************************************************************************
//
// The following are defines for the bit fields in the S3_MTP_CMP8 register
//
//*************************************************************************************************
#define SENT_S3_MTP_CMP8_TOGGLETIME_S   0U
#define SENT_S3_MTP_CMP8_TOGGLETIME_M   0x7FFU        //
#define SENT_S3_MTP_CMP8_RSVD_S         11U
#define SENT_S3_MTP_CMP8_RSVD_M         0xFFFFF800U   //

//*************************************************************************************************
//
// The following are defines for the bit fields in the S3_MTP_CMP9 register
//
//*************************************************************************************************
#define SENT_S3_MTP_CMP9_TOGGLETIME_S   0U
#define SENT_S3_MTP_CMP9_TOGGLETIME_M   0x7FFU        //
#define SENT_S3_MTP_CMP9_RSVD_S         11U
#define SENT_S3_MTP_CMP9_RSVD_M         0xFFFFF800U   //

//*************************************************************************************************
//
// The following are defines for the bit fields in the S3_MTP_CMP10RE register
//
//*************************************************************************************************
#define SENT_S3_MTP_CMP10RE_TOGGLETIME_S   0U
#define SENT_S3_MTP_CMP10RE_TOGGLETIME_M   0x7FFU        //
#define SENT_S3_MTP_CMP10RE_RSVD_S         11U
#define SENT_S3_MTP_CMP10RE_RSVD_M         0xFFFFF800U   //

//*************************************************************************************************
//
// The following are defines for the bit fields in the S3_MTP_PERIOD register
//
//*************************************************************************************************
#define SENT_S3_MTP_PERIOD_PERIOD_S   0U
#define SENT_S3_MTP_PERIOD_PERIOD_M   0x7FFU        //
#define SENT_S3_MTP_PERIOD_RSVD_S     11U
#define SENT_S3_MTP_PERIOD_RSVD_M     0xFFFFF800U   //

